modules/Booking/Controllers/BookingController.php

update `users` set `name` = 'tripAB tripAB', `first_name` = 'tripAB', `last_name` = 'tripAB', `Foreign_FirstName` = 'tripA', `Foreign_LastName` = 'tripA', `Foreign_Registration` = 'q1234568', `Registration` = 'qw12345678', `Foreign_Start_Date` = '2020-04-15', `Foreign_End_Date` = '', `users`.`updated_at` = '2020-04-30 04:24:18' where `id` = 1
---
        $user->Foreign_Start_Date = $request->input('Foreign_Start_Date');
        $user->Foreign_End_Date = $request->input('Foreign_End_Date');

        $user->save();