modules/User/Controllers/UserController.php

update `users` set `deleted_at` = '2020-04-30 11:50:40', `users`.`updated_at` = '2020-04-30 11:50:40' where `id` = 31
---
    public function delete($id){
        $user = User::find($id);
        $user->delete();